Repository: DevOpenWRT-Router/luci-app-tn-ttyd
Catalog: po/*/ttyd.po
Languages: ru

source: Advanced Settings
ru: Дополнительные настройки

source: Basic Authentication
ru: Базовая аутентификация

source: Basic Settings
ru: Основные настройки

source: Can't load non-SSL terminal into page loaded over HTTPS
ru: Невозможно загрузить не SSL терминал на странице, загруженной через HTTPS

source: Check origin
ru: Проверять источник подключения

source: Credentials for basic authentication
ru: Учётные данные для базовой аутентификации

source: Do not allow clients to write to the TTY
ru: Запретить клиентам запись в TTY

source: Do not allow websocket connection from different origin
ru: Не разрешать websocket подключения с других доменов

source: Enable SSL
ru: Включить SSL

source: HTTPS certificate (PEM&nbsp;format)
ru: Сертификат HTTPS (формат&nbsp;PEM)

source: HTTPS private key (PEM&nbsp;format)
ru: Приватный ключ HTTPS (формат&nbsp;PEM)

source: If terminal is not displayed and you use self-signed SSL certificate may you need to open terminal in a separate browser window using the appropriate button above and approve the certificate manually. After approving the certificate you need to reload this page.
ru: Если терминал не отображается, и при этом используется самоподписанный SSL сертификат, возможно потребуется открыть терминал в отдельном окне браузера, используя для этого соответствующую кнопку выше, и добавить сертификат в исключения безопасности браузера вручную. После добавления сертификата необходимо перезагрузить эту страницу.

source: Interface
ru: Интерфейс

source: Length of the private key in bits
ru: Длина приватного ключа в битах

source: Listen only on the given interface or, if unspecified, on all
ru: Принимать подключения только на указанном интерфейсе или, если интерфейс не задан, на всех интерфейсах

source: Maximum clients
ru: Максимальное количество клиентов

source: Maximum clients to support (default: 0, no limit)
ru: Максимальное количество одновременных подключения (по умолчанию: 0, без ограничений)

source: Message types for logging
ru: Типы сообщений для журналирования

source: Must have certificate when using SSL
ru: Для использования SSL необходимо установить HTTPS сертификат

source: Must have key when using SSL
ru: Для использования SSL необходимо установить приватный ключ HTTPS

source: Number of days a generated certificate is valid
ru: Количество дней, в течение которых сгенерированный сертификат действителен

source: Open terminal in a separate window
ru: Открыть терминал в отдельном окне

source: Password
ru: Пароль

source: Password for basic authentication
ru: Пароль для базовой аутентификации

source: Port
ru: Порт

source: Port to listen (default: 7681)
ru: Порт для входящих соединений (по умолчанию: 7681)

source: Read only
ru: Режим просмотра

source: Remove certificate and key
ru: Удалить сертификат и ключ

source: SSL Settings
ru: Настройки SSL

source: SSL certificate file path
ru: Путь к файлу SSL сертификата

source: SSL key file path
ru: Путь к файлу приватного ключа SSL

source: Select websockets library message types for logging (default: LLL_ERR and LLL_WARN)
ru: Выбор типов сообщений библиотеки websockets для журналирования (по умолчанию: LLL_ERR и LLL_WARN)

source: Self-signed SSL certificate parameters
ru: Параметры самоподписанного SSL сертификата

source: Setup
ru: Настройка

source: Start TTYd server
ru: Запустить TTYd сервер

source: TTYd server is not running
ru: Служба TTYd не запущена

source: TTYd server settings
ru: Настройка сервера TTYd

source: TTYd will generate a new self-signed certificate using the configuration shown below
ru: TTYd автоматически сгенерирует новый самоподписанный сертификат, используя настройки приведенные ниже

source: Terminal
ru: Терминал

source: Terminal settings
ru: Настройка терминала

source: The city where your company is legally located
ru: Название города, где была проведена официальная регистрация компании

source: The fully-qualified domain name
ru: Полное доменное имя сервера

source: The name of your department within the organization
ru: Название отдела организации

source: The state/province where your company is legally located
ru: Область, где была проведена официальная регистрация компании

source: The two-letter country code where your company is legally located
ru: ISO-код страны

source: Use basic authentication
ru: Использовать базовую аутентификацию

source: Username
ru: Имя пользователя

source: Username for basic authentication
ru: Имя пользователя для базовой аутентификации

source: You can enable SSL in terminal settings page or use HTTP connection instead of HTTPS. Also you can open terminal in a separate window using the appropriate button below.
ru: Вы можете включить поддержку SSL на странице настроек терминала или использовать HTTP подключение вместо HTTPS. Также вы можете открыть терминал в отдельном окне браузера, используя для этого соответствующую кнопку ниже.

source: Your company's legally registered name
ru: Название огранизации
